# GetNormals Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshTopology..::..GetNormals Method
PolymeshTopology Class See Also
---
Returns all normals assigned to the polymesh
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<XYZ> GetNormals()
```

Visual Basic
---
```text
Public Function GetNormals As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetNormals()
```

# ### Return Value
An array of XYZ values, each representing a normal vector
# See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace